<HTML>
<HEAD>
<TITLE>Alguns coment&aacute;rios sobre meu tutorial de assembly</TITLE>

<META http-equiv="PICS-Label" content='(PICS-1.0 "http://www.rsac.org/ratingsv01.html" l gen true comment "RSACi North America Server" by "gavin@senator.demon.co.uk" for "http://www.strangecreations.com" on "1996.04.04T08:15-0500" exp "1997.07.01T08:15-0500" r (n 0 s 0 v 0 l 0))'>

</HEAD>

<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#CC0000" ALINK="#FF3300" VLINK="#330099">

<CENTER><FONT FACE="Arial"><H2>Alguns coment&aacute;rios sobre meu tutorial de
assembly</H2></FONT></CENTER>

<BLOCKQUOTE>

"Eu gostaria de dizer que voc&ecirc; escreveu um dos melhores tutoriais de
assembly j&aacute; vistos."

<P>

"Um guia terrivelmente bom. Coisa fina. Ele realmente me motivou a
retomar a programa&ccedil;&atilde;o em baixo n&iacute;vel."

<P>

"Obrigado pela sua introdu&ccedil;&atilde;o ao assembly do 80x86. Foi
muito &uacute;til."

<P>

"Obrigado pelo &oacute;timo tutorial de assembly. Muito bom para iniciantes."

<P>

"Obrigado por fazer um excelente trabalho."

<P>

"Uma palavra para agradecer por um tutorial muito bem feito."

<P>

"&Eacute; o melhor tutorial de assembly na web. Eu acho realmente &oacute;timo
que voc&ecirc; o tenha feito. Ele me ajudou a entender os livros que estou
lendo" 

<P>

"Eu achei que o tutorial que voc&ecirc; fez ficou &oacute;timo e me ajudou
muito a fazer meu pr&oacute;prio programa."

<P>

"Eu fiz o download e li seu tutorial. Eu lhe digo que nunca havia
visto assembly antes e acho que o seu tutorial foi muito bom na
explica&ccedil;&atilde;o de assembly."

<P>

"Eu gostei demais do seu tutorial de assembly. Ele foi a base do meu
aprendizado de assembly."

<P>

"Bem, antes de tudo deixe-me dizer que eu realmente gostei da leitura
de seu guia para o assembly. Do meu ponto de vista eu devo dizer que
ele &eacute; um dos melhores que h&aacute; por a&iacute;."

<P>

"Ap&oacute;s haver programado em C/C++, Delphi, VB e v&aacute;rias outras
linguagens e aplica&ccedil;&otilde;es eu decidi finalmente explorar a
linguagem assembly. De alguma forma eu acabei trope&ccedil;ando em sua
p&aacute;gina "Gavin's Guide to 80x86 Assembly". Achei ela perfeita! [..]
Sua p&aacute;gina &eacute; um tutorial perfeito para novatos, como eu!
N&oacute;s apreciamos seu trabalho :)"

<P>

"Eu encontrei seu guia na Internet e gostei muito porque ele foi escrito
de uma forma simples e cont&eacute;m todos os t&oacute;picos essenciais."

<P>

"S&oacute; queria agradecer por voc&ecirc; ter escrito aquele artigo
sobre Assembly. Eu sou um novato e tive muita dificuldade em (leia como:
n&atilde;o consegui) encontrar um livro que fosse bom em apresentar
tudo o que voc&ecirc; precisa para come&ccedil;ar e escrever um
programa que interaja com o usu&aacute;rio... Este artigo &eacute;
&oacute;timo! Obrigado!"

<P>

"Obrigado por me orientar [ a utilizar o tutorial ] e muito obrigado
por faz&ecirc;-lo! Eu comprei o Assembly Passo a Passo mas o autor
somente divagava e eu n&atilde;o cheguei a aprender coisa alguma
que me convencesse que assembly valia a pena ser aprendido. Seus
tutoriais t&ecirc;m o tamanho necess&aacute;rio e eu gostei muito
mais deles do que dos livros que comprei!"

<P>

"S&oacute; queria que voc&ecirc; soubesse que achei seu tutorial de
linguagem Assembly muito &uacute;til. Eu estou come&ccedil;ando a
aprender Assembly e voc&ecirc; realmente me ajudou. Eu estou usando o
A86 e os exemplos de c&oacute;digos que voc&ecirc; forneceu eram
exatamente o que eu estava procurando. Seu tutorial me propiciou um
bom in&iacute;cio. Todos os livros que eu consultei eram muito
confusos."

<P>

"Eu s&oacute; queria lhe enviar uma nota de agradecimentos - durante
as &uacute;ltimas semanas eu procurei um bom tutorial de assembly e o
seu (reconhecidamente) &eacute; de longe o melhor que eu encontrei.
A maioria dos tutoriais que encontrei apresentavam ENORMES lacunas de
&quot;conhecimento presumido&quot;, o que me deixava a merc&ecirc; de
&quot;experimenta&ccedil;&atilde;o&quot; e do descobrimento do que
funcionava ou n&atilde;o - em coisas t&atilde;o simples quanto como
definir vari&aacute;veis! Mas eu gostaria de dizer que a leitura de
seu FAQ proporcionou um al&iacute;vio prazeiroso depois de examinar o
material acima mencionado; Tem sido MUITO &uacute;til." 

</BLOCKQUOTE>

<P>
<HR>
<P>

Retornar para <A HREF="asm1.htm">Guia para o Assembly 80x86, de Gavin</A>

</BODY>
</HTML>
